<template>
<!-- 图片许可使用协议 -->
<div aria-labelledby="myModalLabel" class="modal fade" id="agreementModal" role="dialog" tabindex="-1">
	<div class="modal-dialog" role="document">
		<div class="modal-content">
			<div class="modal-header">
				<button class="close" data-dismiss="modal" type="button">×</button>
				<h4 class="modal-title" id="myModalLabel">
					图片许可使用协议
				</h4>
			</div>
			<div class="modal-body">
				<div>
					<p><strong>一、重要须知</strong></p>
					<p>（一）请仔细阅读本协议。</p>
					<p>本《图片许可使用协议》（以下简称“本协议”）是您（或称为“爱你城问答作者”）与哈希表计算机技术有限公司（以下简称“哈希表公司”）之间就您在爱你城“问答”发布问答内容搜索、浏览、编辑自有内容进行资讯传播所达成的协议。</p>
					<p>（二）阅读和认可。</p>
					<p><strong>请首先仔细阅读并充分理解本协议。一旦您在爱你城问答中搜索、浏览、使用各种功能，即表示您已经充分的阅读、理解并同意本协议，同时，也意味着您已经与哈希表公司签订了一份具有法律效力的协议，愿意遵守本协议及爱你城平台公示的各项规则、规范的全部内容，若您不同意则可停止注册、登录或使用哈希表公司为您提供的本服务。</strong></p>
					<p>（三）《协议》的修订和补充。</p>
					<p>哈希表公司欢迎您在使用爱你城问答时选择本服务为公众展示更优质的内容。哈希表公司保留对本协议不时修订和补充的权利。哈希表公司会对本协议的部分内容进行修改。修改后，将提示协议有更新，您应及时查看更新后的协议。如果您同意接受修改后的协议，您可以继续使用爱你城爱你城问答本服务；如果您不接受则应停止使用本服务。</p>
					
					<p><strong>二、定义</strong></p>
					<p>1、“您”指已提交有效申请并注册的爱你城用户，可在爱你城“问答”平台登录、上传、发布等以各种形式传播内容（包括文字、图片、音频、视频、图表、漫画等）的自然人、法人或其他组织。</p>
					<p>2、“爱你城问答”是指哈希表公司在爱你城平台提供的“爱你城问答”（https://wenda.toutiao.com）及客户端“问答”频道，用户可以发布问题、评论或观点，并上传并发布文字、图片等内容，进行信息获取、分享及传播。哈希表公司为提供信息存储空间的网络服务提供者。</p>
					<p>3、“用户”：指所有直接或间接使用爱你城提供的相关服务的用户。</p>
					<p>4、“本服务”是指哈希表公司向您提供的在爱你城问答按本协议要求使用免费素材库图片以丰富您自有作品内容进行传播的软件及相关服务。</p>

					<p><strong>三、图片使用范围及要求</strong></p>
					<p>（一）图片使用范围：</p>
					<p>1、本协议包含了哈希表公司免费素材库里的图片，许可您以非独占方式 使用的协议条款。</p>
					<p>2、您仅有对特定已获许可图片的有限使用权：</p>
					<p><strong>2.1哈希表公司仅许可您在爱你城问答使用本服务提供的许可图片，您不得将该图片用于非爱你城问答的其他平台。</strong></p>
					<p><strong>2.2您通过本协议获得许可使用的图片性质和类型为创意类图片。您登录您的爱你城帐号在编辑自有内容时，可通过本服务以搜索关键词等方式(哈希表公司不提供下载服务）获得许可的图片，您应且仅应当在爱你城问答页面（以发布问题、评论或观点为目的）的合法使用，不得用于出版、商业用途、广告等其他用途。</strong></p>
					<p>（二）图片使用的要求及限制：</p>
					<p>1、您使用许可图片应基于为用户展示更优质问答内容，使用图片应与您自有内容正文相关联，不得出现使用的图片与内容正文毫无关系、或刻意使用某图片，或全部或大部分使用许可的图片建立图集的方式展示内容、以及哈希表公司认为不利于用户体验及平台的等情形。</p>
					<p>2、如有特殊图片（附有清晰明显文字提示的图片），您应按照注释要求使用图片。</p>
					<p><strong>3、您充分的理解并确认对于许可使用的每张图片均须附上一个可清晰辨认的图片来源说明，哈希表公司有权在您使用的每张图片上署名“爱你城”，您也理解并同意哈希表公司有权在每张图片上添加您的爱你城帐户名称，来源署名及您的爱你城帐户名称添加位置以哈希表公司确定的为准。</strong></p>
					<p>4、您在内容正文仅可插入使用相关图片，且应保证图片内容的完整性，不得对基于本服务在爱你城问答获得的图片进行二次裁剪、编辑、修图、改变、润饰、美化等。</p>
					<p>5、本服务提供图片不包括肖像权（特别注明除外），您应自行取得相关人员的肖像权授权。如因肖像权产生的任何纠纷，哈希表公司及爱你城不承担责任。</p>
					<p>6、您通过本服务能够对哈希表公司授予使用的图片，不得再许可任何第三方对该图片的全部或局部进行再许可；不得向任何第三方对该图片的全部或局部进行买卖、转让、租借，不得将该图片的全部或局部或允许任何第三方将该图片的全部或局部作为任何一种服务标志或商标的全部或局部，不得在除本协议约定之外的爱你城问答上复制或展示该图片的全部或局部，不得将该图片的全部或局部放置在网上任何可供下载的位置或FTP格式下，不得将该图片的全部或局部用于诋毁或损害他人名誉、欺诈、侵犯、扭曲事实或其它一切违反法律法规或侵犯他人合法利益的用途。</p>
					<p>7、未经哈希表公司的明确的事先书面许可，您不得将图片用于本协议未列出或禁止、限制的用途。</p>
					<p>8、您可使用的图片次数、张数权限以哈希表公司爱你城问答本服务后台开放的权限为准。</p>
					
					<p><strong>四、双方权利和义务</strong></p>
					<p>1、您有权按本协议要求有权限的使用许可图片，您应遵守本协议、《爱你城用户协议》及哈希表公司公示的各项规则、规范的全部内容，不违反国家相关的法律法规，不侵犯他人的合法权益，不违反社会公德及公序良俗。</p>
					<p>2、哈希表公司有权根据用户的不同自行决定开放权限供用户选择使用图片库中的图片，哈希表公司有权随时收集、检查、管理用户的登录情况以及使用图片的情况。</p>
					<p>3、您充分的理解并同意，哈希表公司有权在您的“爱你城问答”的问答内容详情页中开设广告位，哈希表公司可自主确定广告价格、广告发布机制、广告位置、规格等发告并收取费用。</p>
					<p>4、未经哈希表公司及其关联公司的同意，您不得对“爱你城问答”软件及相关服务涉及的相关网页、应用、软件等产品进行反向工程、反向汇编、反向编译等。</p>
					<p>5、您理解并确认：您基于本协议获得的图片库的图片的知识产权仍归属权利人所有，您不享有该图片的知识产权。哈希表公司提供本服务时所依托的软件的著作权、专利权及其他知识产权均归哈希表公司及其关联公司所有。</p>
					<p>6、哈希表公司为爱你城问答软件及相关服务的开发、运营提供技术支持，并对软件及相关服务的开发和运营等过程中产生的所有数据和信息等享有全部权利。</p>
					<p>7、哈希表公司尊重并保护自然人、法人和其他组织的知识产权、名誉权、肖像权、姓名权、隐私权等合法权益。您应保证，在使用爱你城问答软件及相关服务时上传的文字、图片、视频、软件以及表演等的信息不侵犯任何第三方的权益。</p>
					<p><strong>8、哈希表公司对于获得的他人的信息或图片不负保证真实、准确和完整性的责任。如因您的作品内容或使用的图片被他人投诉或如遇其他主体向哈希表公司作品内容或其他主体提出异议，哈希表公司有权立即下架、删除该信息及图片且不承担责任的。如因您的原因引起的问题或纠纷，您应承担全部责任，并应赔偿哈希表公司因此遭受的损失，包括但不限于如因其他主体提起的因侵犯著作权、肖像权、名誉权、姓名权、隐私权等纠纷产生的一切责任（包括但不限于停止侵权、赔礼道歉、消除影响、赔偿损失）。</strong></p>
					<p>9、若您或其他任何主体以任何形式侵犯本服务图片库中图片著作权的，哈希表公司或东方IC有权进行维权，维权形式包括但不限于：监测侵权行为、发送维权函、提起诉讼或仲裁、接受调解、和解等任何方式，做出任何独立决策并独立实施并有权转授权专业第三方从事上述维权形式。</p>
					<p>10、在任何情况下，如果哈希表公司有理由认为您的任何行为违反或可能违反本协议约定的，哈希表公司可在任何时候不经任何事先通知终止向您提供服务。</p>
					
					<p><strong>五、服务的变更、中断和终止</strong></p>
					<p>1、您理解并同意，哈希表公司提供的本服务是按照现有技术和条件所能达到的现状提供的。哈希表公司会尽最大努力向您提供服务，确保服务的连贯性和安全性；但哈希表公司不能随时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。</p>
					<p>2、您理解并同意，哈希表公司为了服务整体运营的需要，有权在公告通知后，在不事先通知您的情况下升级、修改、中断、中止或终止相关服务，而无须向您或其他任何主体负责或承担任何责任。</p>
					<p><strong>3、如哈希表公司发现您违反本协议、《爱你城用户协议》及哈希表公司公示的各项规则、规范的或被他人举报投诉时，哈希表公司有权视行为情节对您的帐号进行处理，处理方式包括但不限于警告、限制或禁止使用全部或部分功能、帐号封禁甚至注销，并有权视具体情况而公告处理结果。</strong></p>
					<p>4、双方终止协议或停止使用本服务的，您已使用的图片可在哈希表公司平台上在原有范围内继续保留。</p>
					<p>5、本协议的提前终止不应影响双方于本协议终止之日前根据本协议约定已产生的权利和义务。</p>
					
					<p><strong>六、违约责任</strong></p>
					<p><strong>1、未经哈希表公司事先书面许可，您超出本协议授权范围使用图片或违反本协议许可他人使用图片的，对违规图片您应按照该类图片正常刊例价格的双倍使用费向哈希表公司支付违约金，同时承担由此给哈希表公司及其他主体造成的全部损失。</strong></p>
					<p><strong>2、您因违反国家法律法规或本协议的约定或您侵害他人任何权利因而衍生或导致任何其他主体向哈希表公司提出任何索赔或请求，包括但不限于诉讼费用、律师费用、差旅费用、和解金额、罚款或生效法律文书中规定的损害赔偿金额、软件使用费等而给哈希表公司造成损失的，您应赔偿哈希表公司因此而遭受的一切损失，并消除影响。</strong></p>

					<p><strong>七、其他</strong></p>
					<p>1、本协议的成立、生效、履行、解释及争议的解决均应适用中华人民共和国法律。倘本协议之任何规定因与中华人民共和国法律抵触而无效，则这些条款将尽可能接近本协议原条文意旨重新解析，且本协议其它规定仍应具有完整的效力及效果。本协议的签署地点为中华人民共和国北京市海淀区，若您与哈希表公司发生争议的，双方应尽量友好协商解决，协商不成，任何一方均应将争议提交北京市海淀区人民法院诉讼解决。</p>
					<p>2、本协议的一条或几条条款被认定为无效、非法或不能执行，并不影响其他条款的效力和合法性，并且双方应当以最接近于该条款意图的新条款替代被认定为无效、非法和不能执行的条款；</p>
					<p>3、本协议可能因国家政策、产品、履行环境发生变化或哈希表公司的需要而进行修改，哈希表公司会将修改后的协议发布在网站上。若您对修改后的协议有异议的，请立即停止登录、使用本服务，若您登录或继续使用本服务，视为认可修改后的协议。</p>
					<p>4、您和哈希表公司均是独立的主体，在任何情况下本协议不构成哈希表公司对您的任何形式的明示或暗示担保或条件，双方之间亦不构成合伙、合营或雇佣关系。</p>
					<p>5、本协议的版权为哈希表公司所有，哈希表公司保留一切解释和修改的权利。</p>
				</div>
			</div>
		</div>
	</div>
</div>
</template>
<script>
export default {
	name: "AgreementModal",
	data() {
		return {};
	}
};
</script>
<style lang="scss" scoped>
#agreementModal {
	.modal-dialog {
		transform: translate(-50%, -50%);
		width: 1098px;
		@media screen and (max-width: 1200px) {
			width: 920px;
		}
		@media screen and (max-width: 992px) {
			width: 680px;
		}
		@media screen and (max-width: 768px) {
			width: 100%;
		}
		.modal-body {
			padding: 20px;
			max-height: 800px;
			overflow: auto;
			& > div {
				font-size: 17px;
				line-height: 40px;
			}
		}
	}
}
</style>
